package net.cutereimu.maplebots

object Cube {
    fun doStuff(s: String) = data[s]?.let { result ->
        "以下是以150级${s}计算的理论结果：\n" + result.joinToString(separator = "\n") {
            val (color, cost) =
                if (it.second[0] <= it.second[1]) "红" to it.second[0]
                else "黑" to it.second[1]
            "想要达到${it.first}的目标，使用${color}魔方，预计消耗${cost.format()}"
        }
    }

    private fun Long.format(): String = when {
        this < 1000000L -> toString()
        this < 100000000L -> "%.2fM".format(this / 1000000.0)
        this < 10000000000L -> "%.2fB".format(this / 1000000000.0)
        this < 100000000000L -> "%.1fB".format(this / 1000000000.0)
        this < 1000000000000L -> "%.0fB".format(this / 1000000000.0)
        this < 10000000000000L -> "%.2fT".format(this / 1000000000000.0)
        this < 100000000000000L -> "%.1fT".format(this / 1000000000000.0)
        else -> "%.0fT".format(this / 1000000000000.0)
    }

    private val data = mapOf(
        "首饰" to listOf(
            "24%+属性%" to listOf(1369500000L, 2200100000L),
            "27%+属性%" to listOf(2265900000L, 3951200000L),
            "30%+属性%" to listOf(6548700000L, 9900450000L),
            "33%+属性%" to listOf(85556400000L, 66519350000L),
            "36%+属性%" to listOf(11535833850000L, 2080868050000L),
            "2条钱" to listOf(18986250000L, 14682300000L),
            "2条爆" to listOf(18986250000L, 14682300000L),
            "2条钱爆" to listOf(4755900000L, 3681800000L),
            "3条钱" to listOf(27361975050000L, 4932354800000L),
        ),
        "腰带" to listOf(
            "24%+属性%" to listOf(1494000000L, 2177650000L),
            "27%+属性%" to listOf(2614500000L, 4287950000L),
            "30%+属性%" to listOf(7208550000L, 9990250000L),
            "33%+属性%" to listOf(72770250000L, 54778000000L),
            "36%+属性%" to listOf(6991695900000L, 1260545050000L),
        ),
        "下衣" to listOf(
            "24%+属性%" to listOf(1680750000L, 2379700000L),
            "27%+属性%" to listOf(3012900000L, 4894100000L),
            "30%+属性%" to listOf(8241900000L, 11157650000L),
            "33%+属性%" to listOf(78621750000L, 58639400000L),
            "36%+属性%" to listOf(6991695900000L, 1260545050000L),
        ),
        "披风" to listOf(
            "24%+属性%" to listOf(1494000000L, 2177650000L),
            "27%+属性%" to listOf(2614500000L, 4287950000L),
            "30%+属性%" to listOf(7208550000L, 9990250000L),
            "33%+属性%" to listOf(72770250000L, 54778000000L),
            "36%+属性%" to listOf(6991695900000L, 1260545050000L),
        ),
        "纹章" to listOf(
            "24%+攻%" to listOf(19197900000L, 20609100000L),
            "30%+攻%" to listOf(39777750000L, 74219700000L),
            "33%+攻%" to listOf(467472600000L, 385780800000L),
            "36%+攻%" to listOf(66777467400000L, 12031920350000L),
            "18%+攻%与1条无视" to listOf(9735900000L, 17668150000L),
            "21%+攻%与1条无视" to listOf(17629200000L, 28736000000L),
            "24%+攻%与1条无视" to listOf(451661100000L, 332484500000L),
        ),
        "手套" to listOf(
            "24%+属性%" to listOf(2415300000L, 3457300000L),
            "27%+属性%" to listOf(4332600000L, 7184000000L),
            "30%+属性%" to listOf(12051600000L, 16837500000L),
            "33%+属性%" to listOf(124898400000L, 94379800000L),
            "36%+属性%" to listOf(12450000000000L, 2245000000000L),
            "2条爆伤" to listOf(11229900000L, 8688150000L),
            "3条爆伤" to listOf(12450000000000L, 2245000000000L),
            "1条爆伤与2条属性" to listOf(4270350000L, 6712550000L),
            "2条爆伤与1条属性" to listOf(69620400000L, 53184050000L),
        ),
        "帽子" to listOf(
            "24%+属性%" to listOf(2228550000L, 3300150000L),
            "27%+属性%" to listOf(3896850000L, 6577850000L),
            "30%+属性%" to listOf(10968450000L, 15737450000L),
            "33%+属性%" to listOf(122221650000L, 93279750000L),
            "36%+属性%" to listOf(13402063950000L, 2417662950000L),
            "3秒CD" to listOf(11790150000L, 9114700000L),
            "4秒CD" to listOf(46998750000L, 35897550000L),
            "5秒CD" to listOf(19494035700000L, 3516500650000L),
            "6秒CD" to listOf(107217569850000L, 19341528100000L),
            "2秒CD与2条属性" to listOf(7694100000L, 12369950000L),
            "3秒CD与1条属性" to listOf(68113950000L, 52488100000L),
            "4秒CD与1条属性" to listOf(272430900000L, 209997300000L),
        ),
        "心脏" to listOf(
            "27%+属性%" to listOf(1481550000L, 2424600000L),
            "30%+属性%" to listOf(4071150000L, 5612500000L),
            "33%+属性%" to listOf(40574550000L, 30464650000L),
            "36%+属性%" to listOf(3830155350000L, 690472200000L),
        ),
        "套服" to listOf(
            "24%+属性%" to listOf(2714100000L, 3681800000L),
            "27%+属性%" to listOf(5054700000L, 8171800000L),
            "30%+属性%" to listOf(13807050000L, 18633500000L),
            "33%+属性%" to listOf(130874400000L, 97522800000L),
            "36%+属性%" to listOf(11535833850000L, 2080868050000L),
        ),
        "上衣" to listOf(
            "24%+属性%" to listOf(2714100000L, 3681800000L),
            "27%+属性%" to listOf(5054700000L, 8171800000L),
            "30%+属性%" to listOf(13807050000L, 18633500000L),
            "33%+属性%" to listOf(130874400000L, 97522800000L),
            "36%+属性%" to listOf(11535833850000L, 2080868050000L),
        ),
        "副手" to listOf(
            "24%+攻%" to listOf(37499400000L, 38636450000L),
            "30%+攻%" to listOf(87199800000L, 163660500000L),
            "33%+攻%" to listOf(1075032600000L, 888368950000L),
            "36%+攻%" to listOf(161409842700000L, 29129570950000L),
            "18%+攻%与1条无视" to listOf(21364200000L, 39063000000L),
            "21%+攻%与1条无视" to listOf(38856450000L, 63982500000L),
            "24%+攻%与1条无视" to listOf(1040384250000L, 770843200000L),
            "1条攻击与2条BD" to listOf(11080500000L, 18588600000L),
            "2条攻击与1条BD" to listOf(16894650000L, 30419750000L),
            "21%+攻击与30%+BD" to listOf(36229500000L, 55810700000L),
            "21%+攻击与35%+BD" to listOf(178582800000L, 145835200000L),
            "21%+攻击与40%+BD" to listOf(535735950000L, 437528050000L),
            "24%+攻击与30%+BD" to listOf(1020663450000L, 714156950000L),
        ),
        "鞋子" to listOf(
            "24%+属性%" to listOf(1892400000L, 2716450000L),
            "27%+属性%" to listOf(3349050000L, 5522700000L),
            "30%+属性%" to listOf(9250350000L, 12841400000L),
            "33%+属性%" to listOf(93848100000L, 70672600000L),
            "36%+属性%" to listOf(9077058450000L, 1636492750000L),
        ),
        "护肩" to listOf(
            "24%+属性%" to listOf(1494000000L, 2177650000L),
            "27%+属性%" to listOf(2614500000L, 4287950000L),
            "30%+属性%" to listOf(7208550000L, 9990250000L),
            "33%+属性%" to listOf(72770250000L, 54778000000L),
            "36%+属性%" to listOf(6991695900000L, 1260545050000L),
        ),
        "武器" to listOf(
            "24%+攻%" to listOf(26182350000L, 28174750000L),
            "30%+攻%" to listOf(54219750000L, 102147500000L),
            "33%+攻%" to listOf(689904300000L, 570611650000L),
            "36%+攻%" to listOf(107217569850000L, 19341528100000L),
            "18%+攻%与1条无视" to listOf(13296600000L, 24403150000L),
            "21%+攻%与1条无视" to listOf(24252600000L, 40185500000L),
            "24%+攻%与1条无视" to listOf(668403150000L, 497267500000L),
            "1条攻击与2条BD" to listOf(6872400000L, 11606650000L),
            "2条攻击与1条BD" to listOf(10507800000L, 19015150000L),
            "21%+攻击与30%+BD" to listOf(22646550000L, 35156700000L),
            "21%+攻击与35%+BD" to listOf(114614700000L, 93728750000L),
            "21%+攻击与40%+BD" to listOf(343844100000L, 281163800000L),
            "24%+攻击与30%+BD" to listOf(656127450000L, 461661800000L),
        ),
    )
}